БухЭксп/InformationRegisters/CW_ЗначенияФинансовыхСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияФинансовыхСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФинансовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФинансовыеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыФинансовыхСтатусов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗначенияФинансовыхСтатусовОбъектов/Ext/ManagerModule.bsl
Процедура ЗаписатьФинансовыйСтатусОбъекта(ОбъектСтатуса, ФинансовыйСтатус) Экспорт
	
	Запись = РегистрыСведений.CW_ЗначенияФинансовыхСтатусовОбъектов.СоздатьМенеджерЗаписи();
	Запись.ОбъектСтатуса = ОбъектСтатуса;
	Запись.Прочитать();
	
	Запись.ОбъектСтатуса = ОбъектСтатуса;
	Запись.ФинансовыйСтатус = ФинансовыйСтатус;
	Запись.Записать(Истина);
	
КонецПроцедуры
